// ==UserScript==
// @name         Tabletka MAPT
// @namespace    http://tampermonkey.net/
// @version      0.1
// @description  Отчет для МАРТ + контролируемые цены
// @author       ChVL
// @match        https://tabletka.by/pharmacies/306
// @match        https://tabletka.by/pharmacies/385
// @match        https://tabletka.by/pharmacies/357
// @match        https://tabletka.by/pharmacies/650
// @icon         https://www.google.com/s2/favicons?sz=64&domain=tabletka.by
// @grant        none
// ==/UserScript==

(window.onload = function() {
// простудный перечень
let PLS = {1: ['АМИЗОН МАКС', 'капсулы 500мг N10', 'Минскинтеркапс', '14.05'], 2: ['АРПЕТОЛ', 'таблетки покрытые оболочкой 100мг N30', 'Лекфарм', '16.44'], 3: ['АРПЕТОЛ', 'таблетки покрытые оболочкой 50мг N30', 'Лекфарм', '6.86'],
           4: ['АЦИКЛОВИР-БЕЛМЕД', 'таблетки 400мг N20', 'Белмедпрепараты', '7.64'], 5: ['ВАЛТРЕКС', 'таблетки покрытые оболочкой 500мг N42', 'Глаксо Вэллком', '115.97'],
           6: ['РЕМАНТАДИН-БЕЛМЕД', 'таблетки 50мг N20', 'Белмедпрепараты', '2.93'], 7: ['ЛИКОПИД', 'таблетки 1мг N10', 'Пептек', '15.70'], 8: ['КАГОЦЕЛ', 'таблетки 12мг N10', 'Ниармедик плюс', '14.44'],
           9: ['ВИТАВИРИН', 'порошок для приг. раствора внутр. 90мг N7', 'АмантисМед ООО', '24.14'], 10: ['ФЛУСТОП', 'капсулы 75мг N10', 'Академфарм', '27.06'], 11: ['ПОЛИОКСИДОНИЙ', 'таблетки 12мг N10', 'Петровакс', '30.71'],
          12: ['ИРС-19', 'аэрозоль 20мл N1', 'Эбботт', '28.35'], 13: ['ЛАФЕРОН-ФАРМБИОТЕК НАЗАЛЬНЫЙ', 'капли назальные 1000000МЕ 1мл N1', 'Рубикон ООО', '21.25'], 14: ['ГЕНФЕРОН ЛАЙТ', 'суппозитории вагин. и ректальн. 125 000ме 5мг упаковка №10', 'Биокад', '--'],
          15: ['ВИФЕРОН', 'суппозитории ректальные 500000МЕ N10', 'Ферон', '21.78'], 16: ['АНАФЕРОН ДЕТСКИЙ', 'таблетки для рассасывания  N20', 'Материа Медика', '10.62'], 17: ['АНАФЕРОН', 'таблетки для рассасывания  N20', 'Материа Медика', '10.90']};
//перечень сердечных
let SLS = {2: ['АМЛОДИПИН', 'таблетки 10мг N30', 'Лекфарм', '3.55'], 3: ['АМЛОДИПИН', 'таблетки 5мг N30', 'Фармлэнд', '5.07'], 4: ['АМЛЕССА', 'таблетки 8мг/10мг N30', 'КРКА', '29.64'],
           5: ['АМЛЕССА', 'таблетки 4мг/10мг N30', 'КРКА', '24.31'], 6: ['АМЛЕССА', 'таблетки 4мг/5мг N30', 'КРКА', '16.51'], 7: ['КО-АМЛЕССА', 'таблетки 8мг/10мг/2.5мг N30', 'КРКА', '44.46'],
           8: ['КО-АМЛЕССА', 'таблетки 8мг/5мг/2.5мг N30', 'КРКА', '42.03'], 9: ['ЭКВАТОР', 'таблетки 10мг/5мг N30', 'Гедеон Рихтер', '23.32'], 10: ['НОРМОДИПИН', 'таблетки 10мг N30', 'Гедеон Рихтер', '17.45'],
          11: ['АНАПРИЛИН', 'таблетки 40мг N50', 'Борисовский ЗМП', '0.92'], 12: ['АТЕНОЛОЛ', 'таблетки 50мг N30', 'Борисовский ЗМП', '0.59'], 13: ['АУДИТОР', 'таблетки 5мг N30', 'Сандоз', '13.42'],
          14: ['АУДИТОР', 'таблетки 10мг N30', 'Сандоз', '25.69'], 15: ['АУДИТОР', 'таблетки 20мг N30', 'Сандоз', '32.09'], 16: ['БРИТОМАР', 'таблетки ретард 5мг N30', 'Феррер', '--'],
          17: ['ДИУВЕР', 'таблетки 5мг N20', 'Плива', '11.60'], 18: ['ДИУВЕР', 'таблетки 10мг N20', 'Плива', '22.24'], 19: ['БЕРЛИПРИЛ', 'таблетки 5мг N30', 'Берлин-Хеми/Менарини', '3.31'],
          20: ['БЕРЛИПРИЛ', 'таблетки 20мг N30', 'Берлин-Хеми/Менарини', '8.51'], 21: ['БЕРЛИПРИЛ', 'таблетки 10мг N30', 'Берлин-Хеми/Менарини', '4.71'], 22: ['БЕРЛИПРИЛ ПЛЮС', 'таблетки 10мг/25мг N30', 'Берлин-Хеми/Менарини', '16.37'],
          23: ['БИОСОТАЛ', 'таблетки 160мг N30', 'Санофи-авентис', '9.24'], 24: ['БИСОПРОЛОЛ-БОРИМЕД', 'таблетки покрытые оболочкой 5мг N30', 'Борисовский ЗМП', '3.08'],
          25: ['КОНКОР', 'таблетки покрытые оболочкой 5мг N30', 'Мерк КГаА', '20.17'], 26: ['КОНКОР', 'таблетки покрытые оболочкой 5мг N50', 'Мерк КГаА', '32.89'],
          27: ['КОНКОР', 'таблетки покрытые оболочкой 10мг N30', 'Мерк КГаА', '25.03'], 28: ['КОНКОР', 'таблетки покрытые оболочкой 10мг N50', 'Мерк КГаА', '44.96'],
          29: ['БИСОПРОЛОЛ-ЛФ', 'таблетки покрытые оболочкой 10мг N30', 'Лекфарм', '--'], 30: ['БЛОКОРДИЛ', 'таблетки 25мг N20', 'КРКА', '2.97'], 31: ['ВАЛИДОЛ', 'капсулы 100мг N30', 'Минскинтеркапс' , '3.59'],
          32: ['ВАЛОДИП', 'таблетки покрытые оболочкой 5мг/80мг N30', 'КРКА', '21.17'], 33: ['ВАЛСАРТАН ПЛЮС', 'таблетки покрытые оболочкой 160мг/12.5мг N30', 'Лекфарм', '17.88'],
          34: ['ВАЛСАРТАН-ЛФ', 'таблетки покрытые оболочкой 160мг N30', 'Лекфарм', '16.35'], 35: ['ВАЛСАРТАН НАН', 'таблетки покрытые оболочкой 80мг N30', 'Академфарм', '9.30'],
          36: ['ВАЛЬСАКОР', 'таблетки покрытые оболочкой 160мг N30', 'КРКА', '16.62'], 37: ['САРТВАЛ', 'таблетки покрытые оболочкой 80мг N28', 'Сандоз', '13.13'],
          38: ['САРТВАЛ', 'таблетки покрытые оболочкой 160мг N28', 'Сандоз', '23.04'], 39: ['САРТВАЛ ПЛЮС', 'таблетки покрытые оболочкой 80мг/12.5мг N28', 'Сандоз', '16.54'],
          40: ['САРТВАЛ ПЛЮС', 'таблетки покрытые оболочкой 160мг/12.5мг N28', 'Сандоз', '19.80'], 41: ['ВЕРОШПИРОН', 'таблетки 25мг N20', 'Гедеон Рихтер', '4.08'], 42: ['ГИДРОХЛОРТИАЗИД', 'таблетки 25мг N20', 'Лекфарм', '0.77'],
          43: ['ДИЛАСИДОМ', 'таблетки 4мг N30', 'Польфарма', '6.83'], 44: ['ДИЛТИАЗЕМ ЛАННАХЕР', 'таблетки покрытые оболочкой ретард 180мг N30', 'Ланнахер Хайльмиттель', '20.42'],
          45: ['ДИРОТОН', 'таблетки 10мг N28', 'Гедеон Рихтер', '9.96'], 46: ['ДИРОТОН', 'таблетки 20мг N28', 'Гедеон Рихтер', '14.44'], 47: ['ЗАРТАН', 'таблетки покрытые оболочкой 50мг N30', 'Фармлэнд', '8.50'],
          48: ['ИНДАЛОНГ', 'таблетки покрытые оболочкой ретард 1.5мг N30', 'Лекфарм', '5.99'], 49: ['ИНДАП', 'капсулы 2.5мг N30', 'Про.Мед.ЦС', '7.04'],
          50: ['ИНДАПАМИД-ФАРМЛЭНД', 'таблетки покрытые оболочкой 2.5мг N30', 'Фармлэнд', '3.07'], 51: ['КАНВЕРС ПЛЮС', 'таблетки 16мг/12.5мг N30', 'Лек', '14.14'],
          52: ['КАНВЕРС', 'таблетки 8мг N30', 'Лек', '7.68'], 53: ['КАПТОПРИЛ-ФАРМЛЭНД', 'таблетки 25мг N50', 'Фармлэнд', '4.72'], 54: ['КАРВЕЛЭНД', 'таблетки 12.5мг N30', 'Фармлэнд', '7.33'],
          55: ['КО-ПРЕНЕССА', 'таблетки 4мг/1.25мг N30', 'КРКА', '21.47'], 56: ['ЛЕРКАМЕН', 'таблетки покрытые оболочкой 10мг N60', 'Берлин-Хеми', '26.56'],
          57: ['ЛИЗИНОПРИЛ БОРИМЕД', 'таблетки 10мг N30', 'Борисовский ЗМП', '3.28'], 58: ['ЛОЗАРТАН', 'таблетки покрытые оболочкой 50мг N30', 'Белмедпрепараты', '6.41'],
          59: ['ЛОРИСТА Н 100', 'таблетки покрытые оболочкой 100мг/12.5мг N30', 'КРКА', '16.12'], 60: ['МЕТОПРОЛОЛ', 'таблетки 25мг N60', 'Лекфарм', '1.82'], 61: ['МОКСОНИДИН-ЛФ', 'таблетки покрытые оболочкой 0.4мг N30', 'Лекфарм', '14.65'],
          62: ['НЕБИЛЕТ', 'таблетки 5мг N28', 'Берлин-Хеми/Менарини', '36.22'], 63: ['НОРВАСК', 'таблетки 10мг N30', 'Р-Фарм', '48.12'], 64: ['НОЛИПРЕЛ А', 'таблетки покрытые оболочкой 2.5мг/0.625мг N30', 'Сервье', '--'],
          65: ['НОЛИПРЕЛ А БИ-ФОРТЕ', 'таблетки покрытые оболочкой 10мг/2.5мг N30', 'Сервье', '39.57'], 66: ['НОЛИПРЕЛ А ФОРТЕ', 'таблетки покрытые оболочкой 5мг/1.25мг N30', 'Сервье', '27.73'],
          67: ['ПАНАНГИН', 'таблетки покрытые оболочкой 158мг/140мг N50', 'Гедеон Рихтер', '8.71'], 68: ['ПАРАЛЕЛЬ', 'таблетки 10мг/5мг N20', 'Белмедпрепараты', '6.77'], 69: ['ПЕРИНДОПРИЛ-ЛФ', 'капсулы 8мг N30', 'Лекфарм', '--'],
          70: ['ПРЕДУКТАЛ ОД', 'капсулы 80мг N30', 'Сервье/Эгис', '42.76'], 71: ['РАМИЛОНГ', 'таблетки 10мг N30', 'Лекфарм', '7.65'], 72: ['РАМИПРИЛ', 'таблетки 5мг N30', 'Борисовский ЗМП', '--'],
          73: ['ПЛАВИКС', 'таблетки покрытые оболочкой 75мг N30', 'Санофи-авентис', '48.67'], 74: ['ПЛАВИКС', 'таблетки покрытые оболочкой 75мг N90', 'Санофи-авентис', '--'],
          75: ['РИБОКСИН', 'таблетки покрытые оболочкой 200мг N50', 'Белмедпрепараты', '2.88'], 76: ['СОРИТМИК', 'таблетки 80мг N20', 'КВЗ', '--'], 77: ['СПИРОНОЛАКТОН-ЛФ', 'таблетки 25мг N30', 'Лекфарм', '--'],
          78: ['СТОПКРИЗ','таблетки покрытые оболочкой 0.4мг N30', 'Салютас Фарма ГмбХ', '18.95'], 79: ['СТОПКРИЗ','таблетки покрытые оболочкой 0.2мг N30', 'Салютас Фарма ГмбХ', '14.43'],
          80: ['ФИЗИОТЕНЗ', 'таблетки покрытые оболочкой 0.4мг N14', 'Эбботт', '22.89'], 81: ['ФИЗИОТЕНЗ', 'таблетки покрытые оболочкой 0.2мг N14', 'Эбботт', '15.02'], 82: ['ТИОТРИАЗОЛИН', 'таблетки 200мг N90', 'Экзон', '--'],
          83: ['ТРИ-ЗИДИН М', 'таблетки покрытые оболочкой ретард 35мг N60', 'Лекфарм', '14.42'], 84: ['ТРИТАЦЕ', 'таблетки 5мг N28', 'Санофи-авентис', '14.39'], 85: ['ТРИТАЦЕ', 'таблетки 10мг N28', 'Санофи-авентис', '23.28'],
          86: ['ТРИТАЦЕ ПЛЮС', 'таблетки 10мг/12.5мг N28', 'Санофи-авентис', '24.21'], 87: ['ТРИТАЦЕ ПЛЮС', 'таблетки 10мг/25мг N28', 'Санофи-авентис', '19.96'], 88: ['ЭГИЛОК', 'таблетки 25мг N60', 'Эгис', '6.59'],
          89: ['ЭКВАПРИЛ', 'таблетки 10мг/5мг N30', 'Лекфарм', '11.11'], 90: ['ЭКВАТОР', 'таблетки 10мг/5мг N30', 'Гедеон Рихтер', '23.32'], 91: ['ЭНАЛАПРИЛ', 'таблетки 10мг N30', 'Лекфарм', '2.36'],
          92: ['ЭНАЛАПРИЛ', 'таблетки 5мг N30', 'Борисовский ЗМП', '0.80'], 93: ['ЭТАЦИЗИН', 'таблетки покрытые оболочкой 50мг N50', 'Олайнфарм', '46.53']};
//перечень контролируемых цен
let BKC = {1: ['АЗИТРОМИЦИН', 'таблетки покрытые оболочкой 500мг N6', 'Фармлэнд', '18.42'], 2: ['ЛЮГЕЛЬ', 'суспензия для приема внутрь 170мл', 'Фармлэнд', '7.89'], 3: ['АМБРОКСОЛ', 'таблетки 30мг N20', 'Борисовский ЗМП', '1.29'],
           4: ['АМОКЛАВ 1000', 'таблетки покрытые оболочкой 875мг/125мг N14', 'Фармлэнд', '20.17'], 5: ['АМОКСИЦИЛЛИН', 'капсулы 250мг N30', 'Белмедпрепараты', '4.73'], 6: ['АМОКСИЦИЛЛИН', 'капсулы 500мг N20', 'Фармлэнд', '11.64'],
           7: ['АНАЛЬГИН', 'таблетки 500мг N20', 'Белмедпрепараты', '1.48'], 8: ['АНГРИМАКС', 'капсулы  N20', 'Минскинтеркапс', '6.98'], 9: ['АРПЕТОЛ', 'таблетки покрытые оболочкой 100мг N20', 'Лекфарм', '11.63'],
          10: ['АРПЕТОЛ', 'таблетки покрытые оболочкой 100мг N30', 'Лекфарм', '16.44'], 11: ['АСПИКАРД', 'таблетки покрытые оболочкой 75мг N50', 'Борисовский ЗМП', '3.17'], 12: ['АТОРВАСТАТИН', 'таблетки покрытые оболочкой 20мг N30', 'Белмедпрепараты', '8.55'],
          13: ['АЦЕТИЛСАЛИЦИЛОВАЯ КИСЛОТА', 'таблетки 500мг N10', 'Борисовский ЗМП', '0.46'], 14: ['БИСОПРОЛОЛ-БОРИМЕД', 'таблетки покрытые оболочкой 5мг N30', 'Борисовский ЗМП', '3.08'], 15: ['ГИДРОХЛОРТИАЗИД', 'таблетки 25мг N20', 'Лекфарм', '0.77'],
          16: ['ГРИППОЛЕК ЛИМОН', 'порошок для приг. раствора внутр.  N10', 'АмантисМед ООО', '8.25'], 17: ['ДИКЛОФЕНАК', 'таблетки покрытые оболочкой 25мг N30', 'Фармлэнд', '2.25'], 18: ['ДОКСИЦИКЛИНА ГИДРОХЛОРИД', 'капсулы 100мг  N10', 'Борисовский ЗМП', '2.45'],
          19: ['ДРОТАВЕРИНА ГИДРОХЛОРИД', 'таблетки 40мг N20', 'Белмедпрепараты', '1.09'], 20: ['ИНДАПАФОН', 'таблетки покрытые оболочкой 2.5мг N30', 'Борисовский ЗМП', '1.19'], 21: ['КАПТОПРИЛ-ЛФ', 'таблетки 25мг N40', 'Лекфарм', '2.25'],
          22: ['КЛОПИДОГРЕЛ', 'таблетки покрытые оболочкой 75мг N30', 'Белмедпрепараты', '11.92'], 23: ['КСИЛИН', 'капли назальные 0.05% 10мл N1', 'Фармтехнология', '4.43'], 24: ['КСИЛИН', 'капли назальные 0.1% 10мл N1', 'Фармтехнология', '4.88'],
          25: ['ЛАНСАЗОЛ', 'капсулы 30мг N20', 'Борисовский ЗМП', '10.19'], 26: ['ЛИЗИНОПРИЛ БОРИМЕД', 'таблетки 5мг N30', 'Борисовский ЗМП', '2.12'], 27: ['ЛОЗАРТАН НАН', 'таблетки покрытые оболочкой 50мг N30', 'Академфарм', '7.64'],
          28: ['ЛОПЕРАМИДА ГИДРОХЛОРИД', 'капсулы 2мг N20', 'Борисовский ЗМП', '0.81'], 29: ['ЛОРАТАДИН-ФАРМЛЭНД', 'таблетки 10мг N10', 'Фармлэнд', '2.42'], 30: ['МЕТОПРОЛОЛ', 'таблетки 25мг N60', 'Белмедпрепараты', '1.99'],
          31: ['МОКСОДИН', 'таблетки покрытые оболочкой 0.2мг N30', 'Рубикон ООО', '11.46'], 32: ['НАФАЗОЛИН', 'капли назальные 0.1% 20мл N1', 'Фармтехнология', '4.43'], 33: ['НИМЕСУБЕЛ', 'таблетки 100мг N20', 'Белмедпрепараты', '2.45'],
          34: ['ОМЕПРАЗОЛ', 'капсулы 20мг N30', 'Борисовский ЗМП', '2.51'], 35: ['ПАРАЦЕТАМОЛ', 'таблетки 200мг N10', 'Борисовский ЗМП', '0.58'], 36: ['ПАРАЦЕТАМОЛ', 'таблетки 500мг N20', 'Борисовский ЗМП', '2.06'],
          37: ['ПЕРИНДОПРИЛ-МИК', 'капсулы 4мг N30', 'Минскинтеркапс', '8.02'], 38: ['РИВАКСАН', 'таблетки покрытые оболочкой 10мг N30', 'Академфарм', '126.32'], 39: ['РИВАКСАН', 'таблетки покрытые оболочкой 15мг N30', 'Академфарм', '140.36'],
          40: ['РИВАКСАН', 'таблетки покрытые оболочкой 20мг N30', 'Академфарм', '151.84'], 41: ['СОНЕКС', 'таблетки покрытые оболочкой 7.5мг N30', 'Рубикон ООО', '8.86'], 42: ['СПИРОНОЛАКТОН-ФТ', 'таблетки покрытые оболочкой 50мг N30', 'Фармтехнология', '9.35'],
          43: ['СУЛЬПИРИД', 'капсулы 50мг N30', 'Борисовский ЗМП', '8.96'], 44: ['СУЛЬФАЦИЛ-НАТРИЙ', 'капли глазные 30% 5мл N1', 'Белмедпрепараты', '2.07'], 45: ['ФЕНИБУТ', 'таблетки 250мг N20', 'Белмедпрепараты', '13.90'],
          46: ['ФЕРРОМЕД', 'таблетки жевательные 100мг N30', 'Мед-Интерпласт', '18.34'], 47: ['ФЛУСТОП', 'капсулы 75мг N10', 'Академфарм', '27.06'], 48: ['ЦИТРАМОН-БОРИМЕД', 'таблетки  N6', 'Борисовский ЗМП', '0.59'],
          49: ['ЭНАЛАПРИЛ', 'таблетки 5мг N30', 'Борисовский ЗМП', '0.80'], 50: ['ЭССЕНЦИКАПС', 'капсулы 300мг N50', 'Минскинтеркапс', '6.43']};
let n1 = 17;
let n2 = 93;
let n3 = 50;
// удаление рекламы и лишних блоков
    let rek1 = document.querySelector ('.reclame-banner');
    rek1.style.display = 'none';
    let rek2 = document.querySelector ('.pharmacy-page');
    rek2.style.display = 'none';
    let rek3 = document.querySelector ('[class = "page-title page-title-nav"]');
    rek3.style.display = 'none';
    let rek4 = document.querySelector ('.header-border');
    rek4.style.display = 'none';
    let rek5 = document.querySelector ('.personal-wrap');
    rek5.style.display = 'none';
    let rek6 = document.querySelector ('.table-pagination');
    rek6.style.display = 'none';
    let rek7 = document.querySelector ('.table-wrap');
    rek7.style.display = 'none';
    let rek8 = document.querySelector ('thead');
    rek8.style.display = 'none';
//поиск внутри аптеки. пока отключаю, но можно включить закомментировав
    let rek9 = document.querySelector ('.page-nav');
    rek9.style.display = 'none';
// улучшаю визуализацию времени обновления аптеки
    let obnov = document.querySelector ('.box .caption');
    obnov.style.color = 'red';
// подменяю 100 строк на 5000 строк на странице, чтобы перебирать все варианты, а не только на 1й странице. выбрал 100 - т.к. они заданы по умолчанию
    let par = document.querySelector ('#tw3');// нашел ссылку для 100 строк на странице и заменяю значение 100 на 5000
    par.value = 5000;
    let t = document.querySelectorAll ('span.select-check-text'); // нахожу и подменяю текст в выпадающем списке при выборе количества строк на странице
    t[9].textContent = 'Показывать по 5000'; // значение 9 узнал при переборе циклом на по console.log

    let rez11 = '';
    let rez21 = '';
    let rez31 = '';// для накопления отклонений
let z1 = 0;
let z2 = 0;
let z3 = 0;// счетчики для последовательного срабатывания window.onclick
//добавление чекбоксов
    let f = document.querySelector ('.header-logo');
    f.outerHTML = '<img src = "https://www.google.com/s2/favicons?sz=64&domain=tabletka.by" style = "padding:0px 2vw;">\
                   <label for = "st1" style = "color: white;">Шаг 1: Анализ базы простудных <input id="st1" class="st1" name = "st1" type="checkbox"></label>\
                   <img src = "https://www.google.com/s2/favicons?sz=64&domain=tabletka.by" style = "padding:0px 2vw;">\
                   <label for = "st2" style = "color: white;"> Шаг 2: Анализ базы сердечных  <input id="st2" class="st2" name = "st2" type="checkbox"></label>\
                   <img src = "https://www.google.com/s2/favicons?sz=64&domain=tabletka.by" style = "padding:0px 2vw;">\
                   <label for = "st3" style = "color: white;"> Шаг 3: Анализ перечня, по контролируемым ценам  <input id="st3" class="st3" name = "st3" type="checkbox"></label>\
                   <img src = "https://www.google.com/s2/favicons?sz=64&domain=tabletka.by" style = "padding:0px 2vw;">\
                   <label for = "st4" style = "color: white;"> Шаг 4: Вывод результатов на печать  <input id="st4" class="st4" name = "st4" type="checkbox"></label>\
                   <img src = "https://www.google.com/s2/favicons?sz=64&domain=tabletka.by" style = "padding:0px 2vw;">';
(window.onclick = function analiz(){
    let st11 = document.querySelector ('#st1');//находим наш чекбокс для дальнейшей проверки наличия галочки
        if (st11.checked && z1 == 0){
    let all = document.querySelectorAll ('.tr-border'); // нахожу блоки с информацией о препарате
               for(let elem of all){
                    let an = elem.textContent.toLowerCase();
// оставлено для проверки наименований, на которых не срабатывает скрипт (например: у анаферона в таблетке перед №20 стоит 2 пробела, а не 1)
//                   if (an.includes("анаферон") && an.includes("10мг")){console.log(an);}
                    let pri = elem.querySelector ('.price-value').textContent.replace("от ", " ").toLowerCase(); // цена
                   for (let i = 1; i <= n1; i++){
                     if (PLS[i].length != 0){
                       let arg = PLS[i]
                       let arg0 = arg[0].toLowerCase();
                       let arg1 = arg[1].toLowerCase();
                       let arg2 = arg[2].toLowerCase();
                       let arg3 = arg[3].toLowerCase();
                       if (an.includes(arg0) && an.includes(arg1) && an.includes(arg2)){
                           if(i == 14){arg[1] = arg[1].replace("упаковка", " ");}// а просто не влазит в сточку, вот и извращаюсь. а тут, т.к. до сверки с таблеткой - нельзя
                           if (pri.includes(arg3)){
                               PLS[i].length = 0;
                               break;
                           }
                           else {
                              rez11 += i + ": " + arg[0] + ' ' + arg[1] + ' ' + arg[2] + ' было ' + arg[3] + ' р. стало ' + pri + '<br>';
                               PLS[i].length = 0;
                               break;
                           }
                }
                }
                }
               }
            alert ("СДЕЛАНО, ШАГАЕМ ДАЛЬШЕ");
            z1 = 5001;
        }
        let st22 = document.querySelector ('#st2');//находим наш чекбокс для дальнейшей проверки наличия галочки
        if (st22.checked && z2 == 0){
    let all = document.querySelectorAll ('.tr-border'); // нахожу блоки с информацией о препарате
               for(let elem of all){
                   let an = elem.textContent.toLowerCase();
                   let pri = elem.querySelector ('.price-value').textContent.replace("от ", " ").toLowerCase(); // цена
// пришлось вынести отдельной развилкой, т.к. 90я позиция вообще никак не срабатывала в общем потоке. с абсолютно этими же параметрами выдавало отсутствие препарата.
                   if (an.includes("экватор") && an.includes("10мг/5мг") && an.includes("гедеон")){
                       let arg = SLS[90]
                       let arg0 = arg[0].toLowerCase();
                       let arg1 = arg[1].toLowerCase();
                       let arg2 = arg[2].toLowerCase();
                       let arg3 = arg[3].toLowerCase();
                           if (pri.includes(arg3)){
                               SLS[90].length = 0;
                           }
                           else {
                              rez21 += "90: " + arg[0] + ' ' + arg[1] + ' ' + arg[2] + ' было ' + arg[3] + ' р. стало ' + pri + '<br>';
                                SLS[90].length = 0;
                           }
                }

                   for (let i = 2; i <= n2; i++){
                     if (SLS[i].length != 0 && i != 90){
                       let arg = SLS[i]
                       let arg0 = arg[0].toLowerCase();
                       let arg1 = arg[1].toLowerCase();
                       let arg2 = arg[2].toLowerCase();
                       let arg3 = arg[3].toLowerCase();
                       if (i == 47) {if (an.includes('лозартан')){while(an.includes('лозартан')){an = an.replace('лозартан', "зозтан");}}}// полное совпадение лозартана и зартана, поэтому подменяю
                       if (i == 58) {if (an.includes('зозтан')){while(an.includes('зозтан')){an = an.replace('зозтан', "лозартан");}}}// отменяю замену, иначе не находит лозартан где надо
                         if (an.includes(arg0) && an.includes(arg1) && an.includes(arg2)){
                           if (pri.includes(arg3)){
                               SLS[i].length = 0;
                               break;
                           }
                           else {
                              rez21 += i + ": " + arg[0] + ' ' + arg[1] + ' ' + arg[2] + ' было ' + arg[3] + ' р. стало ' + pri + '<br>';
                                SLS[i].length = 0;
                               break;
                           }
                }
                }
                }
               }
            alert ('СДЕЛАНО, ШАГАЕМ ДАЛЬШЕ');
            z2 = 5001;
        }
            let st33 = document.querySelector ('#st3');//находим наш чекбокс для дальнейшей проверки наличия галочки
        if (st33.checked && z3 == 0){
    let all = document.querySelectorAll ('.tr-border'); // нахожу блоки с информацией о препарате
               for(let elem of all){
                    let an = elem.textContent.toLowerCase();
                    let pri = elem.querySelector ('.price-value').textContent.replace("от ", " ").toLowerCase(); // цена
                   for (let i = 1; i <= n3; i++){
                     if (BKC[i].length != 0){
                       let arg = BKC[i]
                       let arg0 = arg[0].toLowerCase();
                       let arg1 = arg[1].toLowerCase();
                       let arg2 = arg[2].toLowerCase();
                       let arg3 = arg[3].toLowerCase();
                         if (an.includes(arg0) && an.includes(arg1) && an.includes(arg2) && !an.includes('ангримакс нео')){// иначе на позиции "ангримакс нео" срабатывает простой ангримакс
                           if (pri.includes(arg3)){
                               BKC[i].length = 0;
                               break;
                           }
                           else {
                              rez31 += i + ": " + arg[0] + ' ' + arg[1] + ' ' + arg[2] + ' было ' + arg[3] + ' р. стало ' + pri + '<br>';
                                BKC[i].length = 0;
                               break;
                           }
                }
                }
                }
               }
            alert ('СДЕЛАНО, ШАГАЕМ ДАЛЬШЕ');
            z3 = 5001;
        }
            let st44 = document.querySelector ('#st4');//находим наш чекбокс для дальнейшей проверки наличия галочки
    if (st44.checked){// проверяем галочку
            if (z1 > 5000 && z2 > 5000 && z3 > 5000){// без этого условия, сначала выводит алертом полную базу форм выпуска (при загрузке) - она не нужна и только мешает, потом обработанную
            if (rez11 != ''){rez11 = "<h5 style = 'color:blue'>У данных препаратов изменились цены:</h5>" + rez11;}
            if (rez21 != ''){rez21 = "<h5 style = 'color:blue'>У данных препаратов изменились цены:</h5>" + rez21;}
            if (rez31 != ''){rez31 = "<h5 style = 'color:blue'>У данных препаратов изменились цены:</h5>" + rez31;}
                let rez12 = '';
                let rez22 = '';
                let rez32 = '';
                for(let i = 1; i <= n1; i++){
                    if (PLS[i].length != 0){
                    let arg=PLS[i];
                    if(i == 14){arg[1] = arg[1].replace("упаковка", " ");}// а просто не влазит в сточку, вот и извращаюсь. а тут, т.к. до сверки с таблеткой - нельзя. сработает тут, если не сработало выше с rez11
                        if (arg[3] == "--"){}
                        else{
                            rez12 += i + ": " + arg[0] + ' ' + arg[1] + ' ' + arg[2] + " цена " + arg[3] + '<br>';}
                }
                }
                for(let i = 2; i <= n2; i++){
                    if (SLS[i].length != 0){
                    let arg=SLS[i];
                        if (arg[3] == "--"){}
                        else{rez22 += i + ": " + arg[0] + ' ' + arg[1] + ' ' + arg[2] + "  цена " + arg[3] + '<br>';}
                }
                }
                for(let i = 2; i <= n3; i++){
                    if (BKC[i].length != 0){
                    let arg=BKC[i];
                        if (arg[3] == "--"){}
                        else{rez32 += i + ": " + arg[0] + ' ' + arg[1] + ' ' + arg[2] + "  цена " + arg[3] + '<br>';}
                }
                }
             if (rez12 != ''){rez12 = "<h5 style = 'color:red'>Данных препаратов нет в наличии:</h5>" + rez12;}
             if (rez22 != ''){rez22 = "<h5 style = 'color:red'>Данных препаратов нет в наличии:</h5>" + rez22;}
             if (rez32 != ''){rez32 = "<h5 style = 'color:red'>Данных препаратов нет в наличии:</h5>" + rez32;}
             let rez13 = '';
             let rez23 = '';
             let rez33 = '';
             if (rez11 != "" || rez12 != ""){rez13 = "<h2 style = 'color:green'> противовирусные и иммуномодуляторы </h2>" + rez11 + rez12;}
                else{rez13 = "<h2 style = 'color:green'> противовирусные и иммуномодуляторы </h2>" + "<h3><b><i style = 'color: silver;'>Без изменений</i></b></h3>";}
             if (rez21 != "" || rez22 != ""){rez23 = "<h2 style = 'color:green'> сердечно-сосудистые разных групп </h2>" + rez21 + rez22;}
                else{rez23 = "<h2 style = 'color:green'> сердечно-сосудистые разных групп </h2>" + "<h3><b><i style = 'color: silver;'>Без изменений</i></b></h3>";}
             if (rez31 != "" || rez32 != ""){rez33 = "<h2 style = 'color:green'> перечень по контролируемым ценам </h2>" + rez31 + rez32;}
                else{rez33 = "<h2 style = 'color:green'> перечень по контролируемым ценам </h2>" + "<h3><b><i style = 'color: silver;'>Без изменений</i></b></h3>";}
             document.write("<h2> На данный момент произошли следующие изменения </h2>" + rez13 + rez23 + rez33);
            }
        }
})
})();